DataProcessors/доп_ВыписнойЭпикриз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>доп_ВыписнойЭпикриз</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыписки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаведующийОтделением</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходГоспитализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛекарственныеПрепаратыТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛечащийВрач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрочиеРекомендации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимИДиета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатГоспитализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекомендованноеЛечение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеПриВыписке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеПриПоступлении</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срочность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТрансфузииТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТрудовыеРекомендации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПеревода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияПеревода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РеестрМедицинскихОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтационараОрганизацииПеревода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтационара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДневниковыеЗаписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Прием</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Прием</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЗначенияПараметровHTML.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияПараметровHTML</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ПараметрыHTML</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыHTML</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументУстановкиЗначенияПараметраПриема</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИндексШаблона</Name>
					<Comment>Индекс строки шаблона приема в документе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыСтационара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыСтационара</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дневной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Круглосуточный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВычисляемыеЗначенияПараметров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВычисляемыеЗначенияПараметров</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АлгоритмВычисления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательВычисляемогоЗначения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолучателиВычисляемогоЗначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокПеременных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыHTML</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПеременной</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приемник</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыHTML</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СвязанныеРеквизиты</Name>
					<Comment>Реквизиты документа, при изменении которых требуется пересчитать параметры, использующие это вычисляемое значение</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СтрокиЭМКНеограниченнойДлины.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СтрокиЭМКНеограниченнойДлины</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВладелецСтроки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныЗаполненияОсмотра</v8:Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыHTML</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексШаблона</Name>
					<Comment>Индекс строки шаблона приема в документе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаШаблонов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТаблицыШаблоновПриема</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиТаблицы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/доп_ВыписнойЭпикриз/Forms/Форма/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ПодтверждениеЗакрытияФормы;

&НаКлиенте
Перем ТегиРазрешающиеВставкуПараметров;

&НаКлиенте
Перем ДанныеЗаголовка;

&НаКлиенте
Перем ЭлементыТаблиц;

&НаКлиенте
Перем СтраницыТекстовыхПолей;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервереБезКонтекста
Функция ВычислитьЗначениеПараметра(Параметр, ДокументОбъект, Выражение, Параметры)
	
	Результат = Неопределено;
	
	Попытка
		Выполнить(Выражение)
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось вычислить значение параметра """ + Параметр + """
		|" + ОписаниеОшибки();
		Сообщение.Сообщить();
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.СтруктураШапки <> Неопределено Тогда
		ПервичныйПрием		= Параметры.СтруктураШапки.ПервичныйПрием;
		ТекущийПрием		= Параметры.СтруктураШапки.Ссылка;
		Филиал				= Параметры.СтруктураШапки.Филиал;
		Клиент				= Параметры.СтруктураШапки.Клиент;
		МедицинскаяКарта	= Параметры.СтруктураШапки.МедицинскаяКарта;
	КонецЕсли;
	
	ЗаполнитьОсмотры();
	АвтозаполнениеПараметров();
	
	ТекстВерсии = СтрШаблон(НСтр("ru='Версия %1'"), РеквизитФормыВЗначение("Объект").ВерсияОбработки());
	Элементы.ВерсияОбработки.Заголовок = ТекстВерсии;
	Элементы.ГруппаВерсия.Заголовок = ТекстВерсии;
	
	УстановитьПараметрыВыбора();
	ИсходВыписан = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(1, Перечисления.ВидыКлассификаторовМинЗдрава.ИсходыГоспитализации);
	
	ШаблонЭпикризаНачало = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ШаблонЭпикризаНачало");
	ШаблонЭпикризаКонец = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ШаблонЭпикризаКонец");
	ШаблонЭпикриза = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Шаблон").ПолучитьТекст();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШаблоныHTMLСоответствияПараметрам.Наименование КАК Наименование,
	               |	ШаблоныHTMLСоответствияПараметрам.Параметр.ТипЗначения КАК ТипЗначения,
	               |	ШаблоныHTMLСоответствияПараметрам.Представление КАК Представление,
	               |	ШаблоныHTMLСоответствияПараметрам.Параметр.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию,
	               |	ШаблоныHTMLСоответствияПараметрам.Параметр КАК Параметр,
	               |	ШаблоныHTMLСоответствияПараметрам.Параметр.ФорматнаяСтрока КАК ФорматнаяСтрока,
	               |	ШаблоныHTMLСоответствияПараметрам.Параметр.ЗначениеПоУмолчанию.АлгоритмВычисления КАК АлгоритмВычисления
	               |ИЗ
	               |	Справочник.ШаблоныHTML.СоответствияПараметрам КАК ШаблоныHTMLСоответствияПараметрам
	               |ГДЕ
	               |	ШаблоныHTMLСоответствияПараметрам.Ссылка = &Ссылка И Параметр В (&ПараметрыПриема)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВычисляемыеЗначенияПараметровСписокПеременных.Ссылка КАК Параметр,
	               |	ВычисляемыеЗначенияПараметровСписокПеременных.Параметр КАК ВложенныйПараметр,
	               |	ВычисляемыеЗначенияПараметровСписокПеременных.Параметр.Наименование КАК ИмяПараметра,
	               |	ВычисляемыеЗначенияПараметровСписокПеременных.ИмяПеременной КАК ИмяПеременной,
	               |	ВычисляемыеЗначенияПараметровСписокПеременных.Параметр.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию,
	               |	ЕстьNull(ВычисляемыеЗначенияПараметровСписокПеременных.Параметр.ЗначениеПоУмолчанию.АлгоритмВычисления, """") КАК АлгоритмВычисления
	               |ИЗ
	               |	Справочник.ВычисляемыеЗначенияПараметров.СписокПеременных КАК ВычисляемыеЗначенияПараметровСписокПеременных
	               |ИТОГИ ПО
	               |	Параметр";
	МассивПараметровПриема = Новый Массив;
	Для Каждого ДанныеПараметра Из Параметры.ЗначенияПараметров Цикл
		МассивПараметровПриема.Добавить(ДанныеПараметра.Параметр);
	КонецЦикла;
	Запрос.УстановитьПараметр("ПараметрыПриема", МассивПараметровПриема);
	Запрос.УстановитьПараметр("Ссылка", Параметры.ШаблонПриема);
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	ВыборкаПараметров = ПакетРезультатов.Получить(0).Выбрать();
	ВыборкаВложенныеПараметрыПоВладельцу = ПакетРезультатов.Получить(1).Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДобавляемыеРеквизиты = Новый Массив;
	
	Пока ВыборкаПараметров.Следующий() Цикл
		УИдРеквизита = "_" + СтрЗаменить(Новый УникальныйИдентификатор, "-", "");
		СтрокаПараметров = СписокПараметров.Добавить();
		СтрокаПараметров.Имя = ВыборкаПараметров.Наименование;
		СтрокаПараметров.УИд = УИдРеквизита;
		СтрокаПараметров.Представление = ВыборкаПараметров.Представление;
		СтрокаПараметров.Параметр = ВыборкаПараметров.Параметр;
		СтрокаПараметров.ФорматнаяСтрока = ВыборкаПараметров.ФорматнаяСтрока;
		СтрокаПараметров.Алгоритм = ВыборкаПараметров.АлгоритмВычисления;
		ВыборкаВложенныеПараметрыПоВладельцу.Сбросить();
		Если ВыборкаВложенныеПараметрыПоВладельцу.НайтиСледующий(ВыборкаПараметров.ЗначениеПоУмолчанию) Тогда
			ВыборкаВложенныеПараметры = ВыборкаВложенныеПараметрыПоВладельцу.Выбрать();
			Пока ВыборкаВложенныеПараметры.Следующий() Цикл
				
				ВложенныйПараметр = Новый Структура;
				ВложенныйПараметр.Вставить("ИмяПеременной", ВыборкаВложенныеПараметры.ИмяПеременной);
				ВложенныйПараметр.Вставить("Параметр", ВыборкаВложенныеПараметры.ВложенныйПараметр);
				ВложенныйПараметр.Вставить("Имя", ВыборкаВложенныеПараметры.ИмяПараметра);
				ВложенныйПараметр.Вставить("Алгоритм", ВыборкаВложенныеПараметры.АлгоритмВычисления);
				
				СтрокаПараметров.ВложенныеПараметры.Добавить(ВложенныйПараметр);
			КонецЦикла;
		КонецЕсли;
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(УИдРеквизита, ВыборкаПараметров.ТипЗначения,, ВыборкаПараметров.Представление));
	КонецЦикла;
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	ВыборкаПараметров.Сбросить();
	СтруктураПоиска = Новый Структура("Имя");
	Пока ВыборкаПараметров.Следующий() Цикл
		Если ТипЗнч(ВыборкаПараметров.ЗначениеПоУмолчанию) = Тип("СправочникСсылка.ВычисляемыеЗначенияПараметров") Тогда
			Продолжить;
		КонецЕсли;
		СтруктураПоиска.Имя = ВыборкаПараметров.Наименование;
		Параметр = СписокПараметров.НайтиСтроки(СтруктураПоиска)[0].УИд;
		ПолеПараметра = Элементы.Добавить(Параметр, Тип("ПолеФормы"), Элементы.СтраницаПараметрыОбщиеДанные);
		ПолеПараметра.ПутьКДанным = Параметр;
		ПолеПараметра.Вид = ВидПоляФормы.ПолеВвода;
		
		ЭтаФорма[Параметр] = ВыборкаПараметров.ЗначениеПоУмолчанию;

		Для Каждого СохраненныйПараметр Из Параметры.ЗначенияПараметров Цикл
			Если СохраненныйПараметр.Параметр = ВыборкаПараметров.Параметр Тогда
				ЭтаФорма[Параметр] = СохраненныйПараметр.Значение;
			КонецЕсли;
		КонецЦикла;
		
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодтверждениеЗакрытияФормы = Ложь;
	
	ЭлементыТаблиц = Новый Соответствие;
	ЭлементыТаблиц.Вставить(Элементы.ГруппаКонсультации,			 Элементы.Консультации);
	
	СтраницыТекстовыхПолей = Новый Массив;
	
	ДанныеЗаголовка = Новый Структура;
	ЗаполнитьСтруктуруДанныхЗаголовка(ДанныеЗаголовка);
	
	ЗаполнитьТекстыHTML();
	ЗаполнитьЗаголовкиТекстовРекомендаций();
	
	ОбновитьПолныйТекстHTML();
	ОбновитьОсмотр();
	
	УстановитьДоступностьПоИсходу();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	//ЗаписатьТекстыHTML();
	ЗадатьВопросСохранитьРезультатПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГруппаЭпикризПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.ГруппаРезультат Тогда
		ОбновитьПолныйТекстHTML();
	КонецЕсли;
	ОбновитьОсмотр();
	
КонецПроцедуры

&НаКлиенте
Процедура ВводЗначенияГиперссылки(Элемент)
	
	ДанныеОповещения = Новый Структура("ИмяЭлемента", Элемент.Имя);
	
	МассивСтруктурПараметров = РаботаСШаблонамиОбработкамиСервер.ПолучитьСоответствиеПараметровОбработки(ЭтотОбъект.Параметры.ШаблонПриема, , Истина);
	Для Каждого СтрокаМассива Из МассивСтруктурПараметров Цикл
		Если Элемент.Имя = СтрокаМассива.Наименование Тогда
			Параметр = СтрокаМассива.Параметр;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ОповещениеОВыборе = Новый ОписаниеОповещения("ВводЗначенияГиперссылкиЗавершение", ЭтотОбъект, ДанныеОповещения);
	МедицинскаяДеятельностьКлиент.ПоказатьФормуВводаТекста(Объект[Элемент.Имя], Параметр, ОповещениеОВыборе, ЭтотОбъект, ПервичныйПрием);
	
КонецПроцедуры

&НаКлиенте
Процедура КонсультацииПриАктивизацииСтроки(Элемент)
	
	ОбновитьОсмотр();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбследованияПриАктивизацииСтроки(Элемент)
	
	ОбновитьОсмотр();
	
КонецПроцедуры

&НаКлиенте
Процедура ОперативныеВмешательстваПриАктивизацииСтроки(Элемент)
	
	ОбновитьОсмотр();
	
КонецПроцедуры

&НаКлиенте
Процедура МедицинскиеВмешательстваПриАктивизацииСтроки(Элемент)
	
	ОбновитьОсмотр();
	
КонецПроцедуры

&НаКлиенте
Процедура ОсмотрыПриАктивизацииСтроки(Элемент)
	
	ОбновитьОсмотр();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СкрытьПоказатьПриемы(Команда)
	
	//Элементы.ГруппаПриемы.Видимость = Не Элементы.ГруппаПриемы.Видимость;
	//Элементы.ГруппаШаблонЗаполнения.Видимость = Не Элементы.ГруппаШаблонЗаполнения.Видимость;
	//
	//Если Элементы.ГруппаПриемы.Видимость Тогда
	//	Элементы.СкрытьПоказатьПриемы.Картинка = БиблиотекаКартинок.ПереместитьВправо;
	//Иначе
	//	Элементы.СкрытьПоказатьПриемы.Картинка = БиблиотекаКартинок.ПереместитьВлево;
	//КонецЕсли;
	
КонецПроцедуры

// Обязательная процедура
//  массив параметрво содержит имя параметра (реквизита формы), а так же его значение
//  в "Текст" хранится строка которая будет выведена на форме в документе "Прием"
//  Должна возвращать структуру с массивом параметров и текстом
//
&НаКлиенте
Процедура Сохранить(Команда)
	
	Если ЗначениеЗаполнено(Объект.ОрганизацияПеревода)
		И Не ЗначениеЗаполнено(Объект.ВидСтационараОрганизацииПеревода)
	Тогда
		ПоказатьПредупреждение(, НСтр("ru='Необходимо указать вид стационара организации, в которую переведён пациент'"));
		Возврат;
	КонецЕсли;
	
	ОбновитьПолныйТекстHTML();
	ПодтверждениеЗакрытияФормы = Истина;
	СтруктураВозврата = СохранитьНаСервере();
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СобытийФормы

&НаСервере
Функция СохранитьНаСервере()
	
	Если Объект.ИсходГоспитализации = ИсходВыписан Тогда
		Объект.ПодразделениеПеревода = Неопределено;
		Объект.ОрганизацияПеревода = Неопределено;
	ИначеЕсли ЗначениеЗаполнено(Объект.ПодразделениеПеревода) Тогда
		Объект.ОрганизацияПеревода = Неопределено;
		Объект.ВидСтационараОрганизацииПеревода = Неопределено;
	ИначеЕсли ЗначениеЗаполнено(Объект.ОрганизацияПеревода) Тогда
		Объект.ПодразделениеПеревода = Неопределено;
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура;
	МассивПараметров = Новый Массив;
	ТаблицаПараметров = Новый Массив;
	
	МетаданныеОбработки = РеквизитФормыВЗначение("Объект").Метаданные();
	//Для Каждого Реквизит Из МетаданныеОбработки.Реквизиты Цикл
	Для Каждого Реквизит Из СписокПараметров Цикл
		//СтрокаПараметра = Параметры.ШаблонПриема.СоответствияПараметрам.Найти(Реквизит.Имя, "Наименование");
		//Если СтрокаПараметра = Неопределено Тогда
		//	Продолжить;
		//КонецЕсли;
		
		//МассивПараметров.Добавить(Новый Структура("Параметр, Значение", СтрокаПараметра.Параметр, Объект[Реквизит.Имя]));
		МассивПараметров.Добавить(Новый Структура("Параметр, Значение", Реквизит.Имя, ЭтаФорма[Реквизит.УИд]));
	КонецЦикла;
	
	Для Каждого ТЧ Из МетаданныеОбработки.ТабличныеЧасти Цикл
		Для Каждого СтрокаТЧ Из Объект[ТЧ.Имя] Цикл
			Если Не ЗначениеЗаполнено(СтрокаТЧ.ИдентификаторСтроки) Тогда
				СтрокаТЧ.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
			КонецЕсли;
			
			Для Каждого Реквизит Из ТЧ.Реквизиты Цикл
				СтрокаПараметраТаблицы = Параметры.ШаблонПриема.СоответствияТаблицамШаблонов.НайтиСтроки(Новый Структура("ТаблицаОбработки, Наименование", ТЧ.Имя, Реквизит.Имя));
				Если СтрокаПараметраТаблицы.Количество() > 0 Тогда
					ПараметрыДинТаблицы = Новый Структура;
					ПараметрыДинТаблицы.Вставить("СсылкаНаТаблицу", СтрокаПараметраТаблицы[0].ТаблицаШаблонов);
					ПараметрыДинТаблицы.Вставить("НомерСтрокиТаблицы", Объект[ТЧ.Имя].Индекс(СтрокаТЧ) + 1);
					ПараметрыДинТаблицы.Вставить("ИдентификаторСтроки", СтрокаТЧ.ИдентификаторСтроки);
					ПараметрыДинТаблицы.Вставить("Параметр", СтрокаПараметраТаблицы[0].Параметр);
					ПараметрыДинТаблицы.Вставить("Значение", СтрокаТЧ[Реквизит.Имя]);
					
					ТаблицаПараметров.Добавить(ПараметрыДинТаблицы);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	СтруктураВозврата.Вставить("МассивПараметров",			 МассивПараметров);
	СтруктураВозврата.Вставить("ТаблицаПараметров",			 ТаблицаПараметров);
	СтруктураВозврата.Вставить("ПредставлениеОсмотра",		 ТекстHTMLОбщий);
	СтруктураВозврата.Вставить("ИдентификаторСтрокиШаблона", Параметры.ИдентификаторСтрокиШаблона);
	СтруктураВозврата.Вставить("Действие",					 "ЗаполнениеОсмотраПоРезультатуОбработки");
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьЗаголовкиТекстовРекомендаций()
	
	// Рекомендации
	ЗначениеПустогоТекстаРекомендаций = ЗначениеПустогоТекстаРекомендаций();
	Элементы.РекомендованноеЛечение.Заголовок	= ?(ЗначениеЗаполнено(Объект.РекомендованноеЛечение),	Объект.РекомендованноеЛечение,	ЗначениеПустогоТекстаРекомендаций);
	Элементы.ТрудовыеРекомендации.Заголовок		= ?(ЗначениеЗаполнено(Объект.ТрудовыеРекомендации),		Объект.ТрудовыеРекомендации,	ЗначениеПустогоТекстаРекомендаций);
	Элементы.ПрочиеРекомендации.Заголовок		= ?(ЗначениеЗаполнено(Объект.ПрочиеРекомендации),		Объект.ПрочиеРекомендации,		ЗначениеПустогоТекстаРекомендаций);
	Элементы.РежимИДиета.Заголовок				= ?(ЗначениеЗаполнено(Объект.РежимИДиета),				Объект.РежимИДиета,				ЗначениеПустогоТекстаРекомендаций);
	
КонецПроцедуры

&НаКлиенте
Функция ЗначениеПустогоТекстаРекомендаций()
	
	Возврат НСтр("ru='Нет'");
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСтруктуруДанныхЗаголовка(ДанныеЗаголовка)
	
	РеквизитыОрганизации = ПроцедурыСпециализацииПоставки.ПолучитьРеквизитыОрганизации(Филиал);
	ЮрАдрес = Новый Структура("Страна, СубъектРФ, Район, Город, НаселПункт, Улица, Дом, Корпус, Квартира");
	ЗаполнитьЗначенияСвойств(ЮрАдрес, МедицинскаяДеятельность.ПолучитьАдресКлиентаДляМедкарты(Клиент, Ложь, Справочники.ВидыКонтактнойИнформации.АдресЮридический));
	ФактАдрес = Новый Структура("Страна, СубъектРФ, Район, Город, НаселПункт, Улица, Дом, Корпус, Квартира");
	ЗаполнитьЗначенияСвойств(ФактАдрес, МедицинскаяДеятельность.ПолучитьАдресКлиентаДляМедкарты(Клиент, Ложь, Справочники.ВидыКонтактнойИнформации.АдресФактический));
	
	ДанныеЗаголовка.Вставить("НазваниеОрганизации",    РеквизитыОрганизации.НазваниеОрганизации);
	ДанныеЗаголовка.Вставить("ОГРН",          РеквизитыОрганизации.ОГРН);
	ДанныеЗаголовка.Вставить("ФИОКлиента",        ОбщегоНазначения.ФИОФизЛица(Клиент));
	ДанныеЗаголовка.Вставить("НомерМедицинскойКарты",  НомерКарты);
	ДанныеЗаголовка.Вставить("ПолКлиента",        Клиент.Пол);
	ДанныеЗаголовка.Вставить("ДатаРожденияКлиента",    Формат(Клиент.ДатаРождения, "ДЛФ=Д"));
	ДанныеЗаголовка.Вставить("ЮрАдрес",          ЮрАдрес);
	ДанныеЗаголовка.Вставить("ФактАдрес",        ФактАдрес);
	ДанныеЗаголовка.Вставить("Подразделение",      Подразделение.Наименование);
	
КонецПроцедуры

&НаСервере
Процедура АвтозаполнениеПараметров()
	
	Если Не ЗначениеЗаполнено(Клиент) Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеПребывания = Стационар.ПолучитьОписаниеПребыванияПациентаВСтационареПоМедкарте(МедицинскаяКарта);
	Обращение = ОписаниеПребывания.Обращение;
	НомерКарты = МедицинскаяКарта.НомерКарты;
	
	ДатаИДокументКлиническогоДиагноза = Стационар.ДанныеДокументаКлиническогоДиагнозаМедкарты(МедицинскаяКарта);
	Если ЗначениеЗаполнено(ДатаИДокументКлиническогоДиагноза.Документ) Тогда
		ОписаниеДиагнозов = Стационар.СтандатноеОписаниеДиагнозовМД_003(ДатаИДокументКлиническогоДиагноза.Документ).ОписаниеДиагнозов;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Обращение) Тогда
		ДатаПоступления = Обращение.ДатаВремяПоступления;
		Если ЗначениеЗаполнено(ДатаПоступления) Тогда
			ДатаВыписки = ОписаниеПребывания.ДатаВыписки;
			Если Не ЗначениеЗаполнено(ДатаВыписки) Тогда
				ДатаВыписки = КонецДня(ДатаПоступления);
			КонецЕсли;
			Объект.ДатаВыписки = ДатаВыписки;
		КонецЕсли;
	
		Подразделение = Обращение.Подразделение;
		ВидСтационара = Подразделение.ВидСтационара;
	КонецЕсли;
	
	СформироватьТекстНетрудоспособности();
	
	МетаданныеОбработки = РеквизитФормыВЗначение("Объект").Метаданные();
	
	Для Каждого ЗначениеПарметра Из Параметры.ЗначенияПараметров Цикл
		
		Если Не ЗначениеЗаполнено(ЗначениеПарметра.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаПараметра = Параметры.ШаблонПриема.СоответствияПараметрам.Найти(ЗначениеПарметра.Параметр, "Параметр");
		Если СтрокаПараметра = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если МетаданныеОбработки.Реквизиты.Найти(СтрокаПараметра.Наименование) <> Неопределено Тогда
			Объект[СтрокаПараметра.Наименование] = ЗначениеПарметра.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Обращение) Тогда
		ДатаПоступления = Обращение.ДатаВремяПоступления;
		Если ЗначениеЗаполнено(ДатаПоступления) Тогда
			Объект.ДатаПоступления = ДатаПоступления;
		КонецЕсли;
		ОбновитьПродолжительностьГоспитализации();
	КонецЕсли;
	
	ТаблицыПараметров = Новый Соответствие;
	ТаблицыОбработки = Новый Массив;
	
	Для Каждого ПараметрТШ Из Параметры.ЗначенияПараметровТаблицШаблона Цикл
		
		Таблица = ТаблицыПараметров.Получить(ПараметрТШ.ИдентификаторТаблицы);
		Если Таблица = Неопределено Тогда
			Попытка
				Таблица = Справочники.ТаблицыШаблоновПриема.ПолучитьСсылку(Новый УникальныйИдентификатор(ПараметрТШ.ИдентификаторТаблицы));
				ТаблицыПараметров.Вставить(ПараметрТШ.ИдентификаторТаблицы, Таблица);
			Исключение
				Продолжить;
			КонецПопытки;
		КонецЕсли;
		
		СтрокиПараметра = Параметры.ШаблонПриема.СоответствияТаблицамШаблонов.НайтиСтроки(Новый Структура("ТаблицаШаблонов, Параметр", Таблица, ПараметрТШ.Параметр));
		Если СтрокиПараметра.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяТаблицы = СтрокиПараметра[0].ТаблицаОбработки;
		ИмяКолонки = СтрокиПараметра[0].Наименование;
		
		МетаданныеТаблицы = МетаданныеОбработки.ТабличныеЧасти.Найти(ИмяТаблицы);
		Если МетаданныеТаблицы = Неопределено
			Или МетаданныеТаблицы.Реквизиты.Найти(ИмяКолонки) = Неопределено
		Тогда
			Продолжить;
		КонецЕсли;
		
		ТаблицаОбработки = Объект[ИмяТаблицы];
		Пока ПараметрТШ.НомерСтрокиТаблицы > ТаблицаОбработки.Количество() Цикл
			ТаблицаОбработки.Добавить();
		КонецЦикла;
		
		СтрокаТаблицы = ТаблицаОбработки[ПараметрТШ.НомерСтрокиТаблицы-1];
		СтрокаТаблицы[ИмяКолонки] = ПараметрТШ.Значение;
		
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ПараметрТШ, "ИдентификаторСтроки");
		
		Если ТаблицыОбработки.Найти(ИмяТаблицы) = Неопределено Тогда
			ТаблицыОбработки.Добавить(ИмяТаблицы);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ИмяЗаполненнойТаблицы Из ТаблицыОбработки Цикл
		Для Каждого СтрокаТаблицы Из Объект[ИмяЗаполненнойТаблицы] Цикл
			Если ИмяЗаполненнойТаблицы = МетаданныеОбработки.ТабличныеЧасти.ДневниковыеЗаписи.Имя Тогда
				ДанныеПриема = ПолучитьДанныеПриема(СтрокаТаблицы.Прием);
			//ИначеЕсли ИмяЗаполненнойТаблицы = МетаданныеОбработки.ТабличныеЧасти.ОперативныеВмешательства.Имя Тогда
			//	ДанныеПриема = ПолучитьДанныеОперативногоВмешательства(СтрокаТаблицы.Прием);
			Иначе
				Продолжить;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ДанныеПриема);
		КонецЦикла;
	КонецЦикла;
	
	// По умолчанию
	Если Не ЗначениеЗаполнено(Объект.ИсходГоспитализации) Тогда
		Объект.ИсходГоспитализации = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(1, Перечисления.ВидыКлассификаторовМинЗдрава.ИсходыГоспитализации);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.РезультатГоспитализации) Тогда
		Объект.РезультатГоспитализации = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(1, Перечисления.ВидыКлассификаторовМинЗдрава.РезультатыОбращения);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.Дата = ТекущаяДата();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ЛечащийВрач) Тогда
		Объект.ЛечащийВрач = Параметры.СтруктураШапки.Врач;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросСохранитьРезультатПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы
		Или Отказ
		Или ПодтверждениеЗакрытияФормы = Истина
	Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	Отказ = Истина;
	ОписаниеОповещения = Новый ОписаниеОповещения("ВопросПередЗакрытиемЗавершение", ЭтотОбъект, Новый Структура("Отказ, ЗавершениеРаботы", Отказ, ЗавершениеРаботы));
	ПоказатьВопрос(ОписаниеОповещения, НСтр("ru='Сохранить изменения?'"), РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Отмена);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередЗакрытиемЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПодтверждениеЗакрытияФормы = Истина;
		Закрыть(СохранитьНаСервере());
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ПодтверждениеЗакрытияФормы = Истина;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеТекстовHTML

&НаКлиенте
Процедура ОбновитьПолныйТекстHTML()
	
	ТекстHTMLОбщий = ШаблонЭпикриза; 
	
	СоответствиеПройденных = Новый Соответствие;
	СоответствиеПройденныхПоУИду = Новый Соответствие;
	СтруктураВложенныхЗначенийПараметров = Новый Структура;
	
	Для Каждого Параметр Из СписокПараметров Цикл
		Если Не Параметр.Алгоритм = "" Тогда
			Продолжить;
		КонецЕсли;
		
		СоответствиеПройденныхПоУИду.Вставить(Параметр.Параметр, ЭтаФорма[Параметр.УИд]);
	КонецЦикла;
	
	Для Каждого Параметр Из СписокПараметров Цикл
		Если ЗначениеЗаполнено(Параметр.Алгоритм) Тогда
			
			Если Параметр.ВложенныеПараметры.Количество() > 0 Тогда
				
				Для Каждого ВложенныйПараметр Из Параметр.ВложенныеПараметры Цикл
					
					ВложенныйПараметр = ВложенныйПараметр.Значение;
					
					ЗначениеВложенногоПараметра = СоответствиеПройденных.Получить(ВложенныйПараметр.Параметр);
					
					Если ЗначениеВложенногоПараметра = Неопределено Тогда
						Если ЗначениеЗаполнено(ВложенныйПараметр.Алгоритм) Тогда
							ЗначениеВложенногоПараметра = ВычислитьЗначениеПараметра(Параметр.ИмяПеременной, ТекущийПрием, ВложенныйПараметр.Алгоритм, СтруктураВложенныхЗначенийПараметров);
						Иначе
							ЗначениеВложенногоПараметра = СоответствиеПройденныхПоУИду.Получить(ВложенныйПараметр.Параметр);
						КонецЕсли;
					КонецЕсли;     
					
					ЗначениеВложенногоПараметра = ?(ЗначениеВложенногоПараметра = Неопределено, "", ЗначениеВложенногоПараметра);
					
					СтруктураВложенныхЗначенийПараметров.Вставить(ВложенныйПараметр.ИмяПеременной, ЗначениеВложенногоПараметра);
					
				КонецЦикла;
				
			КонецЕсли;
			
			ИсходноеЗначениеПараметра = ВычислитьЗначениеПараметра(Параметр.Имя, ТекущийПрием, Параметр.Алгоритм, СтруктураВложенныхЗначенийПараметров);
			ЗначениеПараметра = ИсходноеЗначениеПараметра;
		Иначе
			
			ИсходноеЗначениеПараметра = ЭтаФорма[Параметр.УИд];
			ЗначениеПараметра = Формат(ИсходноеЗначениеПараметра, Параметр.ФорматнаяСтрока);
		КонецЕсли;
		
		Параметр.Значение = ИсходноеЗначениеПараметра;
		СоответствиеПройденных.Вставить(Параметр.Параметр, ИсходноеЗначениеПараметра);
		
		ТекстHTMLОбщий = СтрЗаменить(ТекстHTMLОбщий, Параметр.Имя, ЗначениеПараметра);
	КонецЦикла; 
	
	ТекстHTMLОбщий = СтрЗаменить(ТекстHTMLОбщий, "{ДневниковыеЗаписи}", ТекстHTMLКонсультации);

	ТекстHTMLОбщий = РаботаСDOMКлиентСервер.СформироватьПолныйТекстДокументаHTML(СформироватьТекстТелаРезультата());
	
КонецПроцедуры

Функция ПолучитьТаблицуЗначенийПараметров(ДокументСсылка)
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗначенияПараметровHTML.Параметр КАК Параметр,
	               |	ЗначенияПараметровHTML.Документ КАК Документ,
	               |	ЗначенияПараметровHTML.ИндексШаблона КАК ИндексШаблона,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(ЗначенияПараметровHTML.Значение) = ТИП(Справочник.СтрокиЭМКНеограниченнойДлины)
	               |			ТОГДА ЗначенияПараметровHTML.Значение.Значение
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК ЗначениеЭМК,
	               |	ЗначенияПараметровHTML.Значение КАК Значение,
	               |	ЗначенияПараметровHTML.Параметр.ВыборПоСсылкеИзОграниченногоСписка КАК ВыборПоСсылкеИзОграниченногоСписка,
	               |	ЗначенияПараметровHTML.Параметр.ФорматнаяСтрока КАК ФорматнаяСтрока,
	               |	ЗначенияПараметровHTML.Параметр.ТипЗначения КАК ТипЗначения,
	               |	ЗначенияПараметровHTML.Параметр.НеРедактируетсяПользователем КАК НеРедактируетсяПользователем,
	               |	ВЫБОР КОГДА ЗначенияПараметровHTML.Параметр.НаименованиеДляВрача = """" ТОГДА ПРЕДСТАВЛЕНИЕ(ЗначенияПараметровHTML.Параметр) ИНАЧЕ ЗначенияПараметровHTML.Параметр.НаименованиеДляВрача КОНЕЦ КАК НаименованиеДляВрача
	               |ИЗ
	               |	РегистрСведений.ЗначенияПараметровHTML КАК ЗначенияПараметровHTML
	               |ГДЕ
	               |	ЗначенияПараметровHTML.Документ = &Документ
	               |	И НЕ ЗначенияПараметровHTML.Параметр.ЭтоГруппа";
	Запрос.УстановитьПараметр("Документ",ДокументСсылка);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеЗаписей(Записи)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗначенияПараметровHTML.Параметр КАК Параметр,
	               |	ЗначенияПараметровHTML.Документ КАК Документ,
	               |	ЗначенияПараметровHTML.ИндексШаблона КАК ИндексШаблона,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(ЗначенияПараметровHTML.Значение) = ТИП(Справочник.СтрокиЭМКНеограниченнойДлины)
	               |			ТОГДА ЗначенияПараметровHTML.Значение.Значение
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК ЗначениеЭМК,
	               |	ЗначенияПараметровHTML.Значение КАК Значение,
	               |	ЗначенияПараметровHTML.Параметр.ВыборПоСсылкеИзОграниченногоСписка КАК ВыборПоСсылкеИзОграниченногоСписка,
	               |	ЗначенияПараметровHTML.Параметр.ФорматнаяСтрока КАК ФорматнаяСтрока,
	               |	ЗначенияПараметровHTML.Параметр.ТипЗначения КАК ТипЗначения,
	               |	ЗначенияПараметровHTML.Параметр.НеРедактируетсяПользователем КАК НеРедактируетсяПользователем,
	               |	ВЫБОР
	               |		КОГДА ЗначенияПараметровHTML.Параметр.НаименованиеДляВрача = """"
	               |			ТОГДА ПРЕДСТАВЛЕНИЕ(ЗначенияПараметровHTML.Параметр)
	               |		ИНАЧЕ ЗначенияПараметровHTML.Параметр.НаименованиеДляВрача
	               |	КОНЕЦ КАК НаименованиеДляВрача,
	               |	ЗначенияПараметровHTML.Документ.Дата КАК ДокументДата
	               |ИЗ
	               |	РегистрСведений.ЗначенияПараметровHTML КАК ЗначенияПараметровHTML
	               |ГДЕ
	               |	ЗначенияПараметровHTML.Документ В(&Записи)
	               |	И НЕ ЗначенияПараметровHTML.Параметр.ЭтоГруппа
	               |	И ЗначенияПараметровHTML.Параметр.Код = ""000003966""
	               |ИТОГИ ПО
	               |	Документ";
	Запрос.УстановитьПараметр("Записи", Записи);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДокументов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СоответствиеДанных = Новый Соответствие;
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		ВыборкаДанных = ВыборкаДокументов.Выбрать();
		СтруктураЗначения = Новый Соответствие;
		Если ВыборкаДанных.Следующий() Тогда
			СтруктураЗначения.Вставить("Результат", ВыборкаДанных.Значение);
		КонецЕсли;
		СтруктураЗначения.Вставить("Дата", ВыборкаДокументов.ДокументДата);
		СоответствиеДанных.Вставить(ВыборкаДокументов.Документ, СтруктураЗначения);
	КонецЦикла;
	
	Возврат СоответствиеДанных;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьТекстHTMLКонсультации()
	
	//ШаблонБлокаКонсультаций =
	//	"<div data-bit-epicrisis-sectionname='Консультации' style='width=19cm'>
	//	|	Осмотры врачей-специалистов, консилиумы врачей, врачебные комиссии:
	//	|	<div style='border:1px solid gray'>
	//	|		<p style='padding-left:5px;padding-right:5px;line-height:20px;background: -webkit-repeating-linear-gradient(top, transparent, transparent 19px, gray 19px, gray 20px)'>%1</p>
	//	|	</div>
	//	|</div>";
	ШаблонНачало = "<p>
	|<b style=""font-family: Calibri, sans-serif; font-size: 14.666666984558105px; text-align: -webkit-center;"">
	|  <span lang=""KZ"" style=""font-family: Arial, sans-serif;"">Дневниковые записи:</span>
	|</b>
	|</p>
	|<table border=""1"" style=""border-color: inherit; border-style: solid; border-collapse: collapse; width: 100%;"">
	|  <tbody>
	|    <tr style=""height: 0px;"">
	|      <td style=""word-wrap: break-word; width: 50%; vertical-align: middle;"">
	|        <b> Дата</b>
	|      </td>
	|      <td style=""word-wrap: break-word; vertical-align: middle; width: 50%;"">
	|        <b>Лабораторно-диагностические исследования</b>
	|      </td>
	|    </tr>";
	ШаблонСтрока = "
	|    <tr style=""height: 0px;"">
	|      <td style=""word-wrap: break-word; width: 50%; vertical-align: middle;""> %1 <br>
	|      </td>
	|      <td style=""word-wrap: break-word; vertical-align: middle; width: 50%;""> %2 </td>
	|    </tr>";
	ШаблонКонец = "
	|  </tbody>
	|</table>";
	
	мКонсультации = Новый Массив;
	
	МассивЗаписей = Новый Массив; 
	Для Каждого СтрокаКонсультации Из Объект.ДневниковыеЗаписи Цикл
		МассивЗаписей.Добавить(СтрокаКонсультации.Прием);
	КонецЦикла;
	
	
	СоответствиеДанных = ПолучитьДанныеЗаписей(МассивЗаписей);
	
	//Для Каждого СтрокаКонсультации Из Объект.Консультации Цикл
	//	мСтрокиКонсультации = Новый Массив;
	//	мСтрокиКонсультации.Добавить(СтрШаблон("%1. Дата и время проведения осмотра: %2. Наименование услуги: %3", мКонсультации.Количество() + 1, СтрокаКонсультации.Дата, СтрокаКонсультации.НМУ));
	//	мСтрокиКонсультации.Добавить(СтрШаблон("Врач, проводивший осмотр: %1.", СтрокаКонсультации.ФИОВрача));
	//	мСтрокиКонсультации.Добавить(СтрШаблон("Должность: %1.", СтрокаКонсультации.ДолжностьПредставление));
	//	мСтрокиКонсультации.Добавить(СтрШаблон("Специальность: %1.", СтрокаКонсультации.СпециализацияПредставление));
	//	мСтрокиКонсультации.Добавить(СтрШаблон("Протокол консультации: %1", СформироватьСтрокуТекстовогоСодержимого(СтрокаКонсультации.Протокол)));
	//	мСтрокиКонсультации.Добавить(СтрШаблон("Заключение консультации: %1", СформироватьСтрокуТекстовогоСодержимого(СтрокаКонсультации.Заключение)));
	//	мКонсультации.Добавить(СтрСоединить(мСтрокиКонсультации, "<br>"));
	//	мКонсультации.Добавить("<br>");
	//КонецЦикла;
	
	//Если мКонсультации.Количество() > 0 Тогда
	//	ТекстКонсультаций = СтрСоединить(мКонсультации, "<br>");
	//Иначе
	//	ТекстКонсультаций = "&nbsp;<br>&nbsp;<br>&nbsp;";
	//КонецЕсли;
	ТекстHTML = ШаблонНачало;
	Для Каждого СтрокаКонсультации Из Объект.ДневниковыеЗаписи Цикл
		ДанныеПриема = СоответствиеДанных.Получить(СтрокаКонсультации.Прием);
		Если Не ДанныеПриема = Неопределено Тогда
			ТекстHTML = ТекстHTML + ШаблонСтрока;
			ТекстHTML = СтрЗаменить(ТекстHTML, "%1", Формат(ДанныеПриема.Получить("Дата"), "ДЛФ=DD"));
			ТекстHTML = СтрЗаменить(ТекстHTML, "%2", ДанныеПриема.Получить("Результат"));
		КонецЕсли;
	КонецЦикла;
	ТекстHTML = ТекстHTML + ШаблонКонец;
	
	ТекстHTMLКонсультации = РаботаСDOMКлиентСервер.СформироватьПолныйТекстДокументаHTML(ТекстHTML);
	
КонецПроцедуры

&НаКлиенте
Функция ТекстHTMLДиагнозы()
	
	ШаблонДиагнозов =
		"<div style='border:1px solid gray'>
		|	<p style='padding-left:5px;padding-right:5px;line-height:20px;background: -webkit-repeating-linear-gradient(top, transparent, transparent 19px, gray 19px, gray 20px)'>%1</p>
		|</div>";
	
	Если ЗначениеЗаполнено(ОписаниеДиагнозов) Тогда
		ТекстОписанияДиагнозов = СформироватьСтрокуТекстовогоСодержимого(ОписаниеДиагнозов);
	Иначе
		ТекстОписанияДиагнозов = "&nbsp;<br>&nbsp;<br>&nbsp;";
	КонецЕсли;
	
	Возврат СтрШаблон(ШаблонДиагнозов, ТекстОписанияДиагнозов);
	
КонецФункции

&НаКлиенте
Процедура ПодчеркнутьНужныйЭлемент(HTMLДокумент, ИмяПараметра, ИдентификаторПодчеркнутогоЭлемента)
	
	ЭлементыПарам = РаботаСHTMLКлиентСервер.ПолучитьЭлементыПоЗначениюАтрибута(HTMLДокумент, ИмяПараметра,, "data-bit-underline-name");
	Для Каждого ЭлементПарам Из ЭлементыПарам Цикл
		
		Если ИдентификаторПодчеркнутогоЭлемента <> Неопределено
			И ЭлементПарам.ПолучитьАтрибут("data-bit-underline-id") = ИдентификаторПодчеркнутогоЭлемента
		Тогда
			// в отдельную процедуру
			ЭлементПарам.УстановитьАтрибут("style", "border-bottom:1px solid gray");
		КонецЕсли;
		ЭлементПарам.УдалитьАтрибут("data-bit-underline-name");
		ЭлементПарам.УдалитьАтрибут("data-bit-underline-id");
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьИдПараметров(ИдПараметров)
	
	Для Каждого КлючЗначение Из ИдПараметров Цикл
		ИдПараметров.Вставить(КлючЗначение.Ключ, Строка(КлючЗначение.Ключ.УИДЕГИСЗ));
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ДатаПериодаНахожденияВСтационаре(ДатаПериода)
	
	ШаблонДатыПериода =
		"<span>
		|	<span>""</span>
		|	<span style='border-bottom:1px solid gray;display:inline-block;min-width:20px;text-align: center'>%1</span>
		|	<span style='padding-right:5px'>""</span>
		|	<span style='border-bottom:1px solid gray;display:inline-block;min-width:60px;text-align: center'>%2</span>
		|	<span style='padding-left:5px'>20</span>
		|	<span style='border-bottom:1px solid gray;display:inline-block;min-width:20px;text-align: center'>%3</span>
		|	<span>г.</span>
		|	<span style='border-bottom:1px solid gray;display:inline-block;min-width:30px;text-align: center'>%4</span>
		|	<span>час.</span>
		|	<span style='border-bottom:1px solid gray;display:inline-block;min-width:30px;text-align: center'>%5</span>
		|	<span>мин.</span>
		|</span>";
	
	Если ЗначениеЗаполнено(ДатаПериода) Тогда
		Возврат СтрШаблон(ШаблонДатыПериода, Формат(ДатаПериода, "ДФ=dd"), Формат(ДатаПериода, "ДФ=MM"), Формат(ДатаПериода, "ДФ=yy"), Формат(ДатаПериода, "ДФ=HH"), Формат(ДатаПериода, "ДФ=mm"));
	Иначе
		Возврат СтрШаблон(ШаблонДатыПериода, "&nbsp;", "&nbsp;", "&nbsp;", "&nbsp;", "&nbsp;");
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция СформироватьТекстТелаРезультата()
	
	мТекстыHTML = Новый Массив;
	мТекстыHTML.Добавить(ТекстHTMLОбщий);
	//мТекстыHTML.Добавить(ТекстHTMLКонсультации);
	//мТекстыHTML.Добавить(ТекстHTMLКонецЭпикриза);
	//мТекстыHTML.Добавить(ТекстHTMLЗаголовок);
	//мТекстыHTML.Добавить(ТекстHTMLОбщиеДанные);
	//мТекстыHTML.Добавить(ТекстHTMLАнамнезЗаболевания);
	//мТекстыHTML.Добавить(ТекстHTMLСостояниеПриПоступлении);
	//мТекстыHTML.Добавить(ТекстHTMLКонсультации);
	//мТекстыHTML.Добавить(ТекстHTMLОбследования);
	//мТекстыHTML.Добавить(ТекстHTMLЛекарственныеПрепараты);
	//мТекстыHTML.Добавить(ТекстHTMLТрансфузии);
	//мТекстыHTML.Добавить(ТекстHTMLОперативныеВмешательства);
	//мТекстыHTML.Добавить(ТекстHTMLМедицинскиеВмешательства);
	//мТекстыHTML.Добавить(ТекстHTMLДополнительныеСведения);
	//мТекстыHTML.Добавить(ТекстHTMLСостояниеПриВыписке);
	//мТекстыHTML.Добавить(ТекстHTMLРекомендации);
	//мТекстыHTML.Добавить(ТекстHTMLПодвал);
	
	ЧастиРезультата = Новый Массив;
	Для Каждого ТекстHTML Из мТекстыHTML Цикл
		ЧастиРезультата.Добавить(РаботаСDOMКлиентСервер.ПолучитьКодТелаHTMLИзКодаДокумента(ТекстHTML));
	КонецЦикла;
	
	Результат = РаботаСШаблонамиHTMLКлиентСервер.НормализоватьОтступы(СтрШаблон("<div style='width: 19cm;'>%1</div>", СтрСоединить(ЧастиРезультата, "<br>")));
	ДокументHTML = РаботаСDOMКлиентСервер.СоздатьДокументDOM(Результат);
	
	ЭлементыСекций = РаботаСHTMLКлиентСервер.ПолучитьЭлементыПоЗначениюАтрибута(ДокументHTML, , , "data-bit-epicrisis-sectionname");
	Для Каждого ЭлементСекции Из ЭлементыСекций Цикл
		ЭлементСекции.УдалитьАтрибут("style");
	КонецЦикла;
	
	Возврат РаботаСDOMКлиентСервер.ПолучитьКодТелаHTMLИзДокументаDOM(ДокументHTML);
	
КонецФункции

&НаКлиенте
Функция СформироватьСтрокуТекстовогоСодержимого(Текст)
	
	ВнутреннийHTMLТекстовогоСодержимого = РаботаСDOMКлиентСервер.ПолучитьВнутреннийHTMLТекстовогоСодержимого(Текст);
	Возврат СтрСоединить(СтрРазделить(ВнутреннийHTMLТекстовогоСодержимого, Символы.ПС), "<br>");
	
КонецФункции

#КонецОбласти

#Область ЛисткиНетрудоспособности

&НаСервереБезКонтекста
Функция ПолучитьДанныеЛНПоМедкартеДляСтационара(МедКарта) Экспорт
	
	ПервыйЛН = ПолучитьДАнныеПервогоЛН(МедКарта);
	
	СтруктураВозврата = ПолучитьСтруктуруЛН();
	
	Если ПервыйЛН.Следующий() Тогда
		
		СтруктураВозврата.НомерЛН = ПервыйЛН.Номер;
		СтруктураВозврата.ДатаНачала = ПервыйЛН.Запись1ДатаНачала;
		СтруктураВозврата.ДатаОкончания = Макс(ПервыйЛН.Запись1ДатаОкончания, ПервыйЛН.Запись2ДатаОкончания, ПервыйЛН.Запись3ДатаОкончания);
		СтруктураВозврата.ВидЛистка = ПервыйЛН.ВидЛистка;
		СтруктураВозврата.Дубликат = ПервыйЛН.Дубликат;
		Если СтруктураВозврата.Дубликат Тогда
			СтруктураВозврата.Вставить("ДокументОснованиеНомер", ?(ТипЗнч(ПервыйЛН.ДокументОснование) = Тип("Строка"), ПервыйЛН.ДокументОснование, ПервыйЛН.ДокументОснование.Номер));
		КонецЕсли;
		
		Если ПервыйЛН.СледующийЛН <> "" Тогда
			СтруктураВозврата.ЛНПродолжение = ПолучитьДанныеЛНПоНомеру(Число(ПервыйЛН.СледующийЛН));
		КонецЕсли;
		
		//Если ЗначениеЗаполнено(СтруктураВозврата.ЛНПродолжение) Тогда
		//	СтруктураВозврата.ДатаВыходаНаРаботу = Макс(СтруктураВозврата.ДатаОкончания, СтруктураВозврата.ЛНПродолжение.ДатаНачалаРаботы);
		//Иначе
		//	СтруктураВозврата.ДатаВыходаНаРаботу = СтруктураВозврата.ДатаОкончания;
		//КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеПервогоЛН(МедКарта)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛистокНетрудоспособности.Номер КАК Номер,
		|	ЛистокНетрудоспособности.Дата КАК Дата,
		|	ЛистокНетрудоспособности.Запись1ДатаНачала КАК Запись1ДатаНачала,
		|	ЛистокНетрудоспособности.Запись1ДатаОкончания КАК Запись1ДатаОкончания,
		|	ЛистокНетрудоспособности.Запись2ДатаОкончания КАК Запись2ДатаОкончания,
		|	ЛистокНетрудоспособности.Запись3ДатаОкончания КАК Запись3ДатаОкончания,
		|	ЛистокНетрудоспособности.ВидЛистка КАК ВидЛистка,
		|	ЛистокНетрудоспособности.Дубликат КАК Дубликат,
		|	ЛистокНетрудоспособности.ДокументОснование КАК ДокументОснование,
		|	ЛистокНетрудоспособности.СледующийЛН КАК СледующийЛН
		|ИЗ
		|	Документ.ЛистокНетрудоспособности КАК ЛистокНетрудоспособности
		|ГДЕ
		|	ЛистокНетрудоспособности.МедицинскаяКарта = &МедКарта
		|	И НЕ ЛистокНетрудоспособности.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
	
	Запрос.УстановитьПараметр("МедКарта", МедКарта);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруЛН()
	
	СтруктураВозврата = Новый Структура;
	
	СтруктураВозврата.Вставить("НомерЛН");
	СтруктураВозврата.Вставить("ДатаНачала");
	СтруктураВозврата.Вставить("ДатаОкончания");
	СтруктураВозврата.Вставить("Дубликат");
	СтруктураВозврата.Вставить("ЛНПродолжение");
	//СтруктураВозврата.Вставить("ДатаВыходаНаРаботу", Дата(1,1,1));
	СтруктураВозврата.Вставить("ВидЛистка");
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеЛНПоНомеру(Номер)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЛистокНетрудоспособности.Номер КАК Номер,
		|	ЛистокНетрудоспособности.Дата КАК Дата,
		|	ЛистокНетрудоспособности.ВидЛистка КАК ВидЛистка,
		|	ЛистокНетрудоспособности.Запись1ДатаНачала КАК Запись1ДатаНачала,
		|	ЛистокНетрудоспособности.Запись1ДатаОкончания КАК Запись1ДатаОкончания,
		|	ЛистокНетрудоспособности.Запись2ДатаОкончания КАК Запись2ДатаОкончания,
		|	ЛистокНетрудоспособности.Запись3ДатаОкончания КАК Запись3ДатаОкончания,
		|	ЛистокНетрудоспособности.СледующийЛН КАК СледующийЛН
		|ИЗ
		|	Документ.ЛистокНетрудоспособности КАК ЛистокНетрудоспособности
		|ГДЕ
		|	ЛистокНетрудоспособности.Номер = &Номер";
	
	Запрос.УстановитьПараметр("Номер", Номер);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураЛН = ПолучитьСтруктуруЛН();
	
	Если Выборка.Следующий() Тогда
		
		СтруктураЛН.НомерЛН = Выборка.Номер;
		СтруктураЛН.ДатаНачала = Выборка.Запись1ДатаНачала;
		СтруктураЛН.ДатаОкончания = Макс(Выборка.Запись1ДатаОкончания, Выборка.Запись2ДатаОкончания, Выборка.Запись3ДатаОкончания);
		СтруктураЛН.ВидЛистка = Выборка.ВидЛистка;
		Если Выборка.СледующийЛН <> "" Тогда
			СтруктураЛН.ЛНПродолжение = ПолучитьДанныеЛНПоНомеру(Число(Выборка.СледующийЛН));
		Иначе
			СтруктураЛН.ЛНПродолжение = ПолучитьСтруктуруЛН();
		КонецЕсли;
		
		//СтруктураЛН.ДатаВыходаНаРаботу = Макс(СтруктураЛН.ДатаОкончания, СтруктураЛН.ЛНПродолжение.ДатаНачалаРаботы);
		
	КонецЕсли;
	
	Возврат СтруктураЛН;
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура ЗаполнитьОсмотры()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Прием.Ссылка КАК Прием,
		|	Прием.Осмотр КАК Осмотр
		|ИЗ
		|	Документ.Прием КАК Прием
		|ГДЕ
		|	Прием.МедицинскаяКарта = &МедицинскаяКарта
		|	И НЕ Прием.ПометкаУдаления
		|	И Прием.Проведен
		|	И НЕ Прием.Ссылка = &ТекущийПрием
		|
		|УПОРЯДОЧИТЬ ПО
		|	Прием.Дата";
	
	Запрос.УстановитьПараметр("МедицинскаяКарта", МедицинскаяКарта);
	Запрос.УстановитьПараметр("ТекущийПрием", ТекущийПрием);
	
	мПриемы = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Осмотры.Добавить(), Выборка);
		мПриемы.Добавить(Выборка.Прием);
	КонецЦикла;
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", мПриемы);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.КонсультацииПрием.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбора()
	
	//ИДСрочности = Новый Массив;
	//ИДСрочности.Добавить(1);
	//ИДСрочности.Добавить(2);
	//ПараметрыВыбора = Новый Массив;
	//ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ВидКлассификатора", Перечисления.ВидыКлассификаторовМинЗдрава.СрочностьГоспитализации));
	//ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.УИДЕГИСЗ", ИДСрочности));
	//Элементы.Срочность.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
	//
	//ИДИсходы = Новый Массив;
	//ИДИсходы.Добавить(1);
	//ИДИсходы.Добавить(2);
	//ИДИсходы.Добавить(3);
	//ПараметрыВыбора = Новый Массив;
	//ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ВидКлассификатора", Перечисления.ВидыКлассификаторовМинЗдрава.ИсходыГоспитализации));
	//ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.УИДЕГИСЗ", ИДИсходы));
	//Элементы.ИсходГоспитализации.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
	//
	//ИДРезультат = Новый Массив;
	//ИДРезультат.Добавить(1);
	//ИДРезультат.Добавить(2);
	//ИДРезультат.Добавить(3);
	//ИДРезультат.Добавить(4);
	//ПараметрыВыбора = Новый Массив;
	//ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ВидКлассификатора", Перечисления.ВидыКлассификаторовМинЗдрава.РезультатыОбращения));
	//ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.УИДЕГИСЗ", ИДРезультат));
	//Элементы.РезультатГоспитализации.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ВводЗначенияГиперссылкиЗавершение(Значение, ДополнительныеПараметры) Экспорт
	
	Если Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяЭлемента = ДополнительныеПараметры.ИмяЭлемента;
	Объект[ИмяЭлемента] = "";
	
	Элемент = Элементы[ИмяЭлемента];
	Если ПустаяСтрока(Значение) Тогда
		Элемент.Заголовок = ЗначениеПустогоТекстаРекомендаций();
	Иначе
		Элемент.Заголовок = Значение;
		Объект[ИмяЭлемента] = Значение;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТекстыHTML()
	
	ОбновитьТекстHTMLКонсультации();
	//ОбновитьТекстHTMLОбследования();
	//ОбновитьТекстHTMLЛекарственныеПрепараты();
	//ОбновитьТекстHTMLТрансфузии();
	//ОбновитьТекстHTMLОперативныеВмешательства();
	//ОбновитьТекстHTMLМедицинскиеВмешательства();
	//ОбновитьТекстHTMLДополнительныхСведений();
	//ОбновитьТекстHTMLСостояниеВыписка();
	//ОбновитьТекстHTMLРекомендаций();
	//ОбновитьТекстHTMLПодвал();
	
КонецПроцедуры

&НаКлиенте
Процедура КонсультацииПриемПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Консультации.ТекущиеДанные;
	ДанныеПриема = ПолучитьДанныеПриема(ТекСтрока.Прием);
	ЗаполнитьЗначенияСвойств(Объект.ДневниковыеЗаписи.НайтиПоИдентификатору(ТекСтрока.ПолучитьИдентификатор()), ДанныеПриема);
	ОбновитьОсмотр();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеПриема(Прием)
	
	ДанныеПриема = Новый Структура("Дата, ФИОВрача, ДолжностьПредставление, СпециализацияПредставление, НМУ");
	
	Если ЗначениеЗаполнено(Прием) Тогда
		ДанныеПриема.Дата = Прием.Дата;
		
		ЗаполнитьЗначенияСвойств(ДанныеПриема, ПолучитьДанныеВрача(Прием.Врач));
		
		мНМУ = Новый Массив;
		Для Каждого СтрокаРаботы Из Прием.Работы Цикл
			Если ЗначениеЗаполнено(СтрокаРаботы.Номенклатура.НоменклатураМедицинскихУслуг) Тогда
				НМУ = СтрокаРаботы.Номенклатура.НоменклатураМедицинскихУслуг;
				мНМУ.Добавить(СтрШаблон("%1 [%2]", НМУ.ПолноеНаименование, НМУ.Код));
			КонецЕсли;
		КонецЦикла;
		
		ДанныеПриема.НМУ = СтрСоединить(мНМУ, ", ");
	КонецЕсли;
	
	Возврат ДанныеПриема;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеВрача(Врач)
	
	ДанныеВрача = Новый Структура("ФИОВрача, ДолжностьПредставление, СпециализацияПредставление");
	
	ДанныеВрача.ФИОВрача = ОбщегоНазначения.ФИОФизЛица(Врач);
	Если ЗначениеЗаполнено(Врач.Должность) Тогда
		ДанныеВрача.ДолжностьПредставление = Врач.Должность.ДолжностьМинздрава.НаименованиеПолное;
	КонецЕсли;
	Если Врач.СпециализацииФРМР.Количество() > 0 Тогда
		ДанныеВрача.СпециализацияПредставление = Врач.СпециализацииФРМР[0].Специализация.НаименованиеПолное;
	КонецЕсли;
	
	Возврат ДанныеВрача;
	
КонецФункции

&НаКлиенте
Процедура ОбследованияПриемПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Обследования.ТекущиеДанные;
	ДанныеПриема = ПолучитьДанныеПриема(ТекСтрока.Прием);
	ЗаполнитьЗначенияСвойств(Объект.Обследования.НайтиПоИдентификатору(ТекСтрока.ПолучитьИдентификатор()), ДанныеПриема);
	ОбновитьОсмотр();
	
КонецПроцедуры

&НаКлиенте
Процедура ОперативныеВмешательстваПриемПриИзменении(Элемент)
	
	ТекСтрока = Элементы.ОперативныеВмешательства.ТекущиеДанные;
	ДанныеПриема = ПолучитьДанныеОперативногоВмешательства(ТекСтрока.Прием);
	ЗаполнитьЗначенияСвойств(Объект.ОперативныеВмешательства.НайтиПоИдентификатору(ТекСтрока.ПолучитьИдентификатор()), ДанныеПриема);
	ОбновитьОсмотр();
	
КонецПроцедуры

&НаКлиенте
Процедура МедицинскиеВмешательстваПриемПриИзменении(Элемент)
	
	ТекСтрока = Элементы.МедицинскиеВмешательства.ТекущиеДанные;
	ДанныеПриема = ПолучитьДанныеПриема(ТекСтрока.Прием);
	ЗаполнитьЗначенияСвойств(Объект.МедицинскиеВмешательства.НайтиПоИдентификатору(ТекСтрока.ПолучитьИдентификатор()), ДанныеПриема);
	ОбновитьОсмотр();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеОперативногоВмешательства(Прием)
	
	ДанныеПриема = Новый Структура("Дата, ФИОВрача, ДолжностьПредставление, СпециализацияПредставление, НМУ, НомерПротокола");
	ЗаполнитьЗначенияСвойств(ДанныеПриема, ПолучитьДанныеПриема(Прием));
	ДанныеПриема.НомерПротокола = Прием.Номер;
	
	Возврат ДанныеПриема;
	
КонецФункции

&НаКлиенте
Процедура ДанныеШапкиПриИзменении(Элемент)
	
	Если Элементы.СтраницыЭпикриза.ТекущаяСтраница = Элементы.ГруппаРезультат Тогда
		ОбновитьПолныйТекстHTML();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьТекстНетрудоспособности()
	
	ДанныеЛН = ПолучитьДанныеЛНПоМедкартеДляСтационара(МедицинскаяКарта);
	
	Если Не ЗначениеЗаполнено(ДанныеЛН.НомерЛН) Тогда
		Возврат;
	КонецЕсли;
	
	ЧастиТекстаЛН = Новый Массив;
	ЧастиТекстаЛН.Добавить(СтрШаблон("Номер листка нетрудоспособности: %1.", ДанныеЛН.НомерЛН));
	Если ЗначениеЗаполнено(ДанныеЛН.ДатаНачала)
		И ЗначениеЗаполнено(ДанныеЛН.ДатаОкончания)
	Тогда
		ЧастиТекстаЛН.Добавить(СтрШаблон("Период нетрудоспособности: с %1 по %2.", Формат(ДанныеЛН.ДатаНачала, "ДЛФ=Д"), Формат(ДанныеЛН.ДатаОкончания, "ДЛФ=Д")));
	КонецЕсли;
	
	ТекстНетрудоспособности = СтрСоединить(ЧастиТекстаЛН, " ");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОсмотр()
	
	ТекстОсмотраТекущегоПриема = РаботаСHTMLКлиентСервер.ПолучитьТекстHTMLПустогоДокумента();
	ТекСтраница = Элементы.СтраницыЭпикриза.ТекущаяСтраница;
	
	Если СтраницыТекстовыхПолей.Найти(ТекСтраница) <> Неопределено Тогда
		Элементы.ГруппаСписокПриемов.Видимость = Истина;
		
		Если Элементы.Осмотры.ТекущиеДанные <> Неопределено Тогда
			ТекстОсмотраТекущегоПриема = Осмотры.НайтиПоИдентификатору(Элементы.Осмотры.ТекущиеДанные.ПолучитьИдентификатор()).Осмотр;
		КонецЕсли;
	Иначе
		Элементы.ГруппаСписокПриемов.Видимость = Ложь;
		
		ЭлементТаблицы = ЭлементыТаблиц.Получить(ТекСтраница);
		Если ЭлементТаблицы <> Неопределено
			И ЭлементТаблицы.ТекущиеДанные <> Неопределено
			И ЗначениеЗаполнено(ЭлементТаблицы.ТекущиеДанные.Прием)
		Тогда
			ТекстОсмотраТекущегоПриема = Осмотры.НайтиСтроки(Новый Структура("Прием", ЭлементТаблицы.ТекущиеДанные.Прием))[0].Осмотр;
		КонецЕсли;
	КонецЕсли;
	
	ТекстПросмотраHTMLПриема = ТекстОсмотраТекущегоПриема;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсмотрыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные <> Неопределено
		И ЗначениеЗаполнено(Элемент.ТекущиеДанные.Прием)
	Тогда
		ПоказатьЗначение(, Элемент.ТекущиеДанные.Прием);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПоступленияПриИзменении(Элемент)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВыпискиПриИзменении(Элемент)
	
	ОбновитьПродолжительностьГоспитализации();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВыпискиВремяПриИзменении(Элемент)
	
	
КонецПроцедуры

&НаКлиенте
Процедура СрочностьПриИзменении(Элемент)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ИсходГоспитализацииПриИзменении(Элемент)
	
	УстановитьДоступностьПоИсходу();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьПоИсходу()
	
	//Элементы.ОрганизацияПеревода.Доступность				= Объект.ИсходГоспитализации <> ИсходВыписан И Не ЗначениеЗаполнено(Объект.ПодразделениеПеревода);
	//Элементы.ПодразделениеПеревода.Доступность				= Объект.ИсходГоспитализации <> ИсходВыписан И Не ЗначениеЗаполнено(Объект.ОрганизацияПеревода);
	//Элементы.ВидСтационараОрганизацииПеревода.Доступность	= Элементы.ОрганизацияПеревода.Доступность И ЗначениеЗаполнено(Объект.ОрганизацияПеревода);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатГоспитализацииПриИзменении(Элемент)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПереводаПриИзменении(Элемент)
	
	УстановитьДоступностьПоИсходу();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПереводаПриИзменении(Элемент)
	
	УстановитьДоступностьПоИсходу();
	Если ЗначениеЗаполнено(Объект.ОрганизацияПеревода) Тогда
		Объект.ВидСтационараОрганизацииПеревода = ПредопределенноеЗначение("Перечисление.ВидыСтационара.Дневной");
		Элементы.ВидСтационараОрганизацииПеревода.АвтоОтметкаНезаполненного = Истина;
	Иначе
		Объект.ВидСтационараОрганизацииПеревода = Неопределено;
		Элементы.ВидСтационараОрганизацииПеревода.АвтоОтметкаНезаполненного = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПродолжительностьГоспитализации()
	
	ПродолжительностьГоспитализации = Документы.ОбращениеВСтационар.ВычислитьПродолжительностьГоспитализации(Обращение, ВидСтационара, Объект.ДатаВыписки).ПродолжительностьГоспитализации;
	
КонецПроцедуры

#КонецОбласти
